/*==============================================================================

    ポリゴン処理のヘッダ [polygon.h]
                                                       作成者 : 中西　祐介
                                                       作成日 : 2016/5/31
--------------------------------------------------------------------------------
    ■Update : 
==============================================================================*/
#ifndef _CAN_H_
#define _CAN_H_

/*------------------------------------------------------------------------------
  　マクロ定義
------------------------------------------------------------------------------*/
#define CAN_WIDTH  ( 50.0f )								 // 缶の幅
#define CAN_HEIGHT ( 72.0f )							 // 缶の高さ
#define CAN_MAX	   (256)						 //	缶の最大数

/*------------------------------------------------------------------------------
  　構造体の宣言
------------------------------------------------------------------------------*/
// 缶の構造体
typedef struct
{
	D3DXVECTOR2 fPos;		// 表示位置の座標
	D3DXVECTOR2 fAxis;		// 回転の中心座標
	D3DXVECTOR2 fMove;		// 横移動量
	D3DXVECTOR2 fLeftUp;	// 左上のX座標
	D3DXVECTOR2 fRightUp;	// 右上のX座標
	D3DXVECTOR2 fLeftDown;	// 左下のX座標
	D3DXVECTOR2 fRightDown; // 右下のX座標
	D3DXVECTOR2 fPosTex;	// テクスチャの座標
	float		fRot;		// 缶の回転量（ラジアン）
	bool		bFly;       // 蹴飛ばされたか否か
	bool        bUse;       // 使用フラグ
}CAN;

/*------------------------------------------------------------------------------
  　プロトタイプ宣言
------------------------------------------------------------------------------*/
void InitCan( void );
void UninitCan( void );
void UpdateCan( void );
void DrawCan( void );
CAN* GetCan( void );

#endif