/*==============================================================================

    ポリゴン処理のヘッダ [GOAL.h]
                                                       作成者 : 中西　祐介
                                                       作成日 : 2016/5/31
--------------------------------------------------------------------------------
    ■Update : 
==============================================================================*/
#ifndef _GOAL_H_
#define _GOAL_H_

/*------------------------------------------------------------------------------
  　マクロ定義
------------------------------------------------------------------------------*/
#define GOAL_WIDTH ( 105.0f )								 // ハードルの幅
#define GOAL_HEIGHT ( 300.0f )							 // ハードルの高さ

/*------------------------------------------------------------------------------
  　構造体の宣言
------------------------------------------------------------------------------*/
// 缶の構造体
typedef struct
{
	D3DXVECTOR2 fPos;		// 座標
	D3DXVECTOR2 fLeftUp;	// 左上の座標
	D3DXVECTOR2 fRightUp;	// 右上の座標
	D3DXVECTOR2 fLeftDown;	// 左下の座標
	D3DXVECTOR2 fRightDown; // 右下の座標
	D3DXVECTOR2 fPosTex;	// テクスチャの座標
	bool		bUse;       // 使用フラグ 
}GOAL;

/*------------------------------------------------------------------------------
  　プロトタイプ宣言
------------------------------------------------------------------------------*/
void InitGoal( void );
void UninitGoal( void );
void UpdateGoal( void );
void DrawGoal( void );
void SetVertexGoal( VERTEX_2D* pVpx );
GOAL* GetGoal( void );

#endif