/*==============================================================================

    ポリゴン処理のヘッダ [polygon.h]
                                                       作成者 : 中西　祐介
                                                       作成日 : 2016/5/31
--------------------------------------------------------------------------------
    ■Update : 
==============================================================================*/
#ifndef _HURDLE_H_
#define _HURDLE_H_

/*------------------------------------------------------------------------------
  　マクロ定義
------------------------------------------------------------------------------*/
#define HURDLE_WIDTH ( 45.0f )								 // ハードルの幅
#define HURDLE_HEIGHT ( 75.0f )							 // ハードルの高さ
#define HURDLE_MAX (256)

/*------------------------------------------------------------------------------
  　構造体の宣言
------------------------------------------------------------------------------*/
// 缶の構造体
typedef struct
{
	D3DXVECTOR2 fPos;		// 座標
	D3DXVECTOR2 fLeftUp;	// 左上の座標
	D3DXVECTOR2 fRightUp;	// 右上の座標
	D3DXVECTOR2 fLeftDown;	// 左下の座標
	D3DXVECTOR2 fRightDown; // 右下の座標
	D3DXVECTOR2 fPosTex;	// テクスチャの座標
	bool		bFall;      // 倒れフラグ 
	bool		bUse;       // 使用フラグ 
}HURDLE;

/*------------------------------------------------------------------------------
  　プロトタイプ宣言
------------------------------------------------------------------------------*/
void InitHurdle( void );
void UninitHurdle( void );
void UpdateHurdle( void );
void DrawHurdle( void );
void SetVertexHurdle( VERTEX_2D* pVpx );
HURDLE* GetHurdle( void );

#endif