/*==============================================================================

    ポリゴン処理のヘッダ [item.h]
                                                       作成者 : 中西　祐介
                                                       作成日 : 2016/5/31
--------------------------------------------------------------------------------
    ■Update : 
==============================================================================*/
#ifndef _ITEM_H_
#define _ITEM_H_

/*------------------------------------------------------------------------------
  　ヘッダファイル
------------------------------------------------------------------------------*/
#include "main.h"

/*------------------------------------------------------------------------------
  　マクロ定義
------------------------------------------------------------------------------*/
#define ITEM_WIDTH ( 60.0f )								 // ハードルの幅
#define ITEM_HEIGHT ( 40.0f )							 // ハードルの高さ
#define ITEM_MAX (256)

/*------------------------------------------------------------------------------
  　構造体の宣言
------------------------------------------------------------------------------*/
// 缶の構造体
typedef struct
{
	D3DXVECTOR2 fPos;		// 座標
	D3DXVECTOR2 fLeftUp;	// 左上の座標
	D3DXVECTOR2 fRightUp;	// 右上の座標
	D3DXVECTOR2 fLeftDown;	// 左下の座標
	D3DXVECTOR2 fRightDown; // 右下の座標
	D3DXVECTOR2 fPosTex;	// テクスチャの座標
	bool        bUse;       // 使用フラグ
}ITEM;

/*------------------------------------------------------------------------------
  　プロトタイプ宣言
------------------------------------------------------------------------------*/
void InitItem( void );
void UninitItem( void );
void UpdateItem( void );
void DrawItem( void );
void SetVertexItem( VERTEX_2D* pVpx );
ITEM* GetItem( void );

#endif