/*==============================================================================

    ポリゴン処理のヘッダ [polygon.h]
                                                       作成者 : 中西　祐介
                                                       作成日 : 2016/5/31
--------------------------------------------------------------------------------
    ■Update : 
==============================================================================*/
#ifndef _JUMPER_H_
#define _JUMPER_H_

/*------------------------------------------------------------------------------
  　ヘッダファイル
------------------------------------------------------------------------------*/
#include "main.h"

/*------------------------------------------------------------------------------
  　マクロ定義
------------------------------------------------------------------------------*/
#define JUMPER_WIDTH ( 80.0f )								 // ハードルの幅
#define JUMPER_HEIGHT ( 60.0f )							 // ハードルの高さ
#define JUMPER_MAX   (256)									// ジャンプ台の最大数

/*------------------------------------------------------------------------------
  　構造体の宣言
------------------------------------------------------------------------------*/
// 缶の構造体
typedef struct
{
	D3DXVECTOR2 fPos;		// 座標
	D3DXVECTOR2 fLeftUp;	// 左上の座標
	D3DXVECTOR2 fRightUp;	// 右上の座標
	D3DXVECTOR2 fLeftDown;	// 左下の座標
	D3DXVECTOR2 fRightDown; // 右下の座標
	D3DXVECTOR2 fPosTex;	// テクスチャの座標
	bool		bUse;       // 使用フラグ
}JUMPER;

/*------------------------------------------------------------------------------
  　プロトタイプ宣言
------------------------------------------------------------------------------*/
void InitJumper( void );
void UninitJumper( void );
void UpdateJumper( void );
void DrawJumper( void );
JUMPER* GetJumper( void );

#endif