/*==============================================================================

    MOVEBG処理のヘッダ [movebg.h]
                                                       作成者 : 中西　祐介
                                                       作成日 : 2016/5/31
--------------------------------------------------------------------------------
    ■Update : 
==============================================================================*/
#ifndef _MOVEBG_H_
#define _MOVEBG_H_

/*------------------------------------------------------------------------------
  　マクロ定義
------------------------------------------------------------------------------*/
#define MOVEBG_TEXTURE_SCROLL_ACCELERATION		(0.0002f)		// MoveBGのテクスチャスクロール加速度
#define MOVEBG_TEXTURE_SCROLL_ACCELERATION_DASH	(0.0004f)		// MoveBGのテクスチャスクロール加速度(ダッシュ時）
#define MOVEBG_TEXTURE_LIMIT_SCROOL_SPEED		(0.0075f)		// MoveBGのテクスチャスクロールスピードの限界値
#define MOVEBG_TEXTURE_LIMIT_SCROOL_SPEED_DASH  (0.015f)		// MoveBGのテクスチャスクロールスピードの限界値(ダッシュ時）

/*------------------------------------------------------------------------------
  　構造体の宣言
------------------------------------------------------------------------------*/
// MoveBGの構造体
typedef struct
{
	float fPosTexX;		    // MoveBGのテクスチャX座標
	float fPosTexY;		    // MoveBGのテクスチャY座標
	float fTexScrollSpeed;  // MoveBGのテクスチャスクロールスピード
}MOVEBG;

/*------------------------------------------------------------------------------
  　プロトタイプ宣言
------------------------------------------------------------------------------*/
void InitMoveBG( void );
void UninitMoveBG( void );
void UpdateMoveBG( void );
void DrawMoveBG( void );
MOVEBG* GetMoveBG( void );

#endif